calidad/PDI_Prjct/src/test/resources/reqConsultaProveedoresRuteador.txt

<soapenv:Envelope xmlns:ws="http://ws.rupe.acce.gub.uy/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <a:Action xmlns:e="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://www.w3.org/2005/08/addressing">http://preprodservicios.pge.red.uy/acce/consultaproveedores/prueba1/descripcion</a:Action>
      <a:MessageID xmlns:e="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://www.w3.org/2005/08/addressing">uuid:35899f00-4731-405b-99e1-3fad5b9f2b3b</a:MessageID>
      <a:To xmlns:e="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://www.w3.org/2005/08/addressing">http://preprodservicios.pge.red.uy/acce/consultaproveedores/prueba2</a:To>
      <wsse:Security soapenv:actor="agesic" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <saml:Assertion AssertionID="Assertion-uuid55845d5f-015f-11de-ab46-85f163fb0008" IssueInstant="2017-10-25T21:50:58Z" Issuer="Urudata" MajorVersion="1" MinorVersion="1" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion">
            <saml:Conditions NotBefore="2017-10-25T21:35:57Z" NotOnOrAfter="2017-10-25T22:05:59Z">
               <saml:AudienceRestrictionCondition>
                  <saml:Audience>http://preprodservicios.pge.red.uy/acce/consultaproveedores/prueba1</saml:Audience>
               </saml:AudienceRestrictionCondition>
            </saml:Conditions>
            <saml:AuthenticationStatement AuthenticationInstant="2017-10-25T21:50:58Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password">
               <saml:Subject>
                  <saml:NameIdentifier>ou=gerencia de proyectos,o=agesic,o=presidencia de la republica,O=Poder Ejecutivo,O=Gobierno Nacional,o=Gobierno,C=UY</saml:NameIdentifier>
               </saml:Subject>
            </saml:AuthenticationStatement>
            <saml:AttributeStatement>
               <saml:Subject>
                  <saml:NameIdentifier>ou=gerencia de proyectos,o=agesic,o=presidencia de la republica,O=Poder Ejecutivo,O=Gobierno Nacional,o=Gobierno,C=UY</saml:NameIdentifier>
               </saml:Subject>
               <saml:Attribute AttributeName="User" AttributeNamespace="urn:tokensimple">
                  <saml:AttributeValue>AGESIC</saml:AttributeValue>
               </saml:Attribute>
            </saml:AttributeStatement>
            <ds:Signature Id="uuid55845d60-015f-19a1-ace8-85f163fb0008" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
               <ds:SignedInfo>
                  <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                  <ds:Reference URI="#Assertion-uuid55845d5f-015f-11de-ab46-85f163fb0008">
                     <ds:Transforms>
                        <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                           <xc14n:InclusiveNamespaces PrefixList="saml" xmlns:xc14n="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </ds:Transform>
                     </ds:Transforms>
                     <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                     <ds:DigestValue>VQdmYUWSaE4G8oFVddNYZJn4iiA=</ds:DigestValue>
                  </ds:Reference>
               </ds:SignedInfo>
               <ds:SignatureValue>O+q441HMpe/0DKoM/hj707nEi3S5oSFaB+jmNjxGPke7ATu4J6NgmfpAio/SqjiWijgCrpZzwsH+7a+fZrI7DzBwuQCDmupExGM+QTbMnWAreBBxO1hwkMV6oXQPwnvwCXVVk3BdpcxCseo0LFoK+cGXJyeIwJmhcG/kKM2XU6o=</ds:SignatureValue>
               <ds:KeyInfo>
                  <ds:X509Data>
                     <ds:X509Certificate>MIICBzCCAXCgAwIBAgIEQH26vjANBgkqhkiG9w0BAQQFADBIMQswCQYDVQQGEwJVUzEPMA0GA1UEChMGVGl2b2xpMQ4wDAYDVQQLEwVUQU1lQjEYMBYGA1UEAxMPZmltZGVtby5pYm0uY29tMB4XDTA0MDQxNDIyMjcxMFoXDTE3MTIyMjIyMjcxMFowSDELMAkGA1UEBhMCVVMxDzANBgNVBAoTBlRpdm9saTEOMAwGA1UECxMFVEFNZUIxGDAWBgNVBAMTD2ZpbWRlbW8uaWJtLmNvbTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAiZ0D1X6rk8+ZwNBTVZt7C85m421a8A52Ksjw40t+jNvbLYDp/W66AMMYD7rB5qgniZ5K1p9W8ivM9WbPxc2u/60tFPg0e/Q/r/fxegW1K1umnay+5MaUvN3p4XUCRrfg79OvurvXQ7GZa1/wOp5vBIdXzg6i9CVAqL29JGi6GYUCAwEAATANBgkqhkiG9w0BAQQFAAOBgQBXiAhxm91I4m+g3YX+dyGc352TSKO8HvAIBkHHFFwIkzhNgO+zLhxg5UMkOg12X9ucW7leZ1IB0Z6+JXBrXIWmU3UPum+QxmlaE0OG9zhp9LEfzsE5+ff+7XpS0wpJklY6c+cqHj4aTGfOhSE6u7BLdI26cZNdzxdhikBMZPgdyQ==</ds:X509Certificate>
                  </ds:X509Data>
               </ds:KeyInfo>
            </ds:Signature>
         </saml:Assertion>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ws:descripcion/>
   </soapenv:Body>
</soapenv:Envelope>